{
  "common_qa": [
    {
      "keywords": ["안녕", "하이", "반가워"],
      "response": "안녕! 나는 꾸미야! 오늘도 함께 신나게 문화재 탐험을 해보자! 🌟"
    },
    {
      "keywords": ["카드", "보상"],
      "response": "우리 앱에서는 두 가지 특별한 카드를 모을 수 있어!\n\n1. '문화재 카드': 문화재를 관람하면서 퀴즈를 맞추면 받을 수 있어\n2. '일화 카드': 랜덤 퀴즈를 풀면 얻을 수 있는 특별한 카드지!\n\n어때? 멋지지 않니? 😊"
    }
  ],
  "cultural_sites": [
    {
      "name": "경복궁",
      "keywords": ["경복궁", "조선 궁궐", "법궁"],
      "basic_info": "경복궁은 조선왕조 제일의 궁궐이야! 1395년 서울이 수도로 정해진 뒤에 처음 지어졌어. '큰 복을 누리라'는 의미를 가진 이름이지! 🏰",
      "fun_fact": "경복궁에는 무려 500년 된 나무가 있대! '영춘화'라는 나무인데, 매년 봄이면 노란 꽃을 피운대. 조선시대 임금님도 보셨던 꽃이라니, 신기하지 않니? 🌳",
      "did_you_know": "경복궁은 조선의 다섯 궁궐 중에서 가장 크고 화려했대! 임금님의 집이라서 그런지 정말 엄청나지? 👑"
    },
    {
      "name": "경회루",
      "keywords": ["경회루", "연못", "누각"],
      "basic_info": "경회루는 경복궁에 있는 아주 멋진 누각이야! 연못 위에 지어진 큰 건물로, 임금님이 외국 손님을 맞이하거나 신하들과 연회를 열던 곳이었단다! 🏯",
      "fun_fact": "경회루가 있는 연못에는 작은 섬이 두 개나 있어! 이 섬들은 신선이 산다는 전설 속의 삼신산을 본떠서 만들었대. 마치 작은 동화 속 풍경 같지 않니? 🏝️",
      "did_you_know": "경회루는 조선의 건물 중에서 가장 큰 누각이라는 거 알고 있었니? 그리고 밤에 연못에 비친 경회루의 모습이 정말 아름답대! ✨"
    },
    {
      "name": "근정전",
      "keywords": ["근정전", "임금님", "왕"],
      "basic_info": "근정전은 경복궁의 가장 중요한 건물이야! 임금님이 신하들과 중요한 일을 의논하고 외국 사신을 만나던 곳이지. 마치 오늘날의 대통령 집무실 같은 곳이었단다! 👑",
      "fun_fact": "근정전 앞마당에는 품계석이라는 재미있는 돌이 있어! 신하들은 자기 관직의 높고 낮음에 따라 이 돌 위에 서서 임금님을 뵈었대. 마치 학교에서 줄 서는 것처럼! 😄",
      "did_you_know": "근정전은 우리나라 1만원권 지폐 뒷면에 그려져 있어! 지금 가지고 있는 1만원권을 한번 살펴보면 근정전을 찾을 수 있을 거야! 💵"
    },
    {
      "name": "사정전",
      "keywords": ["사정전", "임금님 일"],
      "basic_info": "사정전은 임금님이 매일매일 나라의 일을 처리하던 곳이야! 오늘날로 치면 임금님의 사무실이라고 할 수 있지! 📚",
      "fun_fact": "사정전에는 특별한 창문이 있었대! '축천창'이라고 하는데, 이 창문으로 하늘의 별자리를 관찰했다고 해! 임금님도 밤하늘 구경을 좋아했나봐! 🌟",
      "did_you_know": "사정전은 '정의로움을 생각하는 곳'이라는 뜻을 가지고 있어! 임금님이 이곳에서 백성들을 위해 열심히 일하셨다는 걸 알 수 있지? 👨‍💼"
    },
    {
      "name": "강녕전",
      "keywords": ["강녕전", "침실", "방"],
      "basic_info": "강녕전은 임금님의 침실이야! 임금님이 잠도 자고 쉬기도 한 곳이지. 왕실의 가장 사적인 공간이었단다! 🛏️",
      "fun_fact": "강녕전 안에는 '온돌'이라는 특별한 난방 장치가 있었어! 바닥 밑으로 따뜻한 연기를 보내서 방을 데웠대. 우리나라 전통 난방 방식이지! 🔥",
      "did_you_know": "강녕전이라는 이름은 '편안함과 화평함이 가득한 곳'이라는 뜻이야! 임금님도 푹 쉬어야 나라를 잘 다스릴 수 있겠지? 😴"
    },
    {
      "name": "교태전",
      "keywords": ["교태전", "왕비", "중전"],
      "basic_info": "교태전은 왕비님이 사시던 곳이야! 경복궁에서 가장 아름다운 건물 중 하나로, 왕비님의 생활 공간이었단다! 👸",
      "fun_fact": "교태전에는 예쁜 정원이 있었대! '아미산'이라고 부르는 작은 동산도 있었는데, 꽃과 나무가 가득했대. 마치 작은 비밀정원 같았겠지? 🌸",
      "did_you_know": "교태전은 '아름답고 화목한 곳'이라는 뜻을 가지고 있어! 왕비님이 이곳에서 편안하게 지내셨다고 해! ✨"
    }
  ],
  "random_facts": [
    "경복궁에는 총 7,700개가 넘는 칸이 있었다고 해! 엄청 크지 않니?",
    "근정전 앞 계단을 '천계'라고 하는데, 하늘로 올라가는 계단이라는 뜻이래!",
    "경회루 연못은 사계절 내내 물이 마르지 않았대. 그래서 '경회지'라고도 불렸어!",
    "사정전에서는 매일 아침 일찍 '조참'이라는 회의를 했대. 임금님도 일찍 일어나셨나봐!",
    "강녕전과 교태전 사이에는 작은 문이 있었대. 임금님과 왕비님이 서로 만나기 편하게!",
    "경복궁의 이름은 태조 이성계가 직접 지었대. 멋진 이름이지?",
    "경복궁 전체 면적은 축구장 40개를 붙여놓은 것만큼 커!",
    "조선시대에는 경복궁에서 과거시험도 보았대. 마치 대학입학시험 같은 거였지!"
  ]
}